IsmkBpelModule/build/localhost_8080/IndicatorResponceServiceService/IndicatorResponceService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3.3-hudson-757-SNAPSHOT. --><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/IndicatorResponceService/IndicatorResponceService" xmlns:ns="http://www.shcherbakov.ru/responce" xmlns:ns0="http://www.shcherbakov.ru/simpleResponce" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" name="IndicatorResponceService" targetNamespace="http://j2ee.netbeans.org/wsdl/IndicatorResponceService/IndicatorResponceService">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/IndicatorResponceService/IndicatorResponceService">
            <xsd:import namespace="http://www.shcherbakov.ru/responce" schemaLocation="http://localhost:8080/IndicatorResponceServiceService/IndicatorResponceService?xsd=1"></xsd:import>
            <xsd:import namespace="http://www.shcherbakov.ru/simpleResponce" schemaLocation="http://localhost:8080/IndicatorResponceServiceService/IndicatorResponceService?xsd=2"></xsd:import>
        </xsd:schema>
    </types>
    <message name="IndicatorResponceServiceOperationRequest">
        <part name="inputPart" element="ns:responce"></part>
    </message>
    <message name="IndicatorResponceServiceOperationResponse">
        <part name="outputPart" element="ns0:simpleResponce"></part>
    </message>
    <portType name="IndicatorResponceServicePortType">
        <operation name="IndicatorResponceServiceOperation">
            <input name="input1" message="tns:IndicatorResponceServiceOperationRequest"></input>
            <output name="output1" message="tns:IndicatorResponceServiceOperationResponse"></output>
        </operation>
    </portType>
    <binding name="IndicatorResponceServicePortTypeBinding" type="tns:IndicatorResponceServicePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"></soap:binding>
        <operation name="IndicatorResponceServiceOperation">
            <soap:operation style="document"></soap:operation>
            <input name="input1">
                <soap:body use="literal" parts="inputPart"></soap:body>
            </input>
            <output name="output1">
                <soap:body use="literal" parts="outputPart"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="IndicatorResponceServiceService">
        <port name="IndicatorResponceServicePortTypeBindingPort" binding="tns:IndicatorResponceServicePortTypeBinding">
            <soap:address location="http://localhost:8080/IndicatorResponceServiceService/IndicatorResponceService"></soap:address>
        </port>
    </service>
</definitions>